---
kind: property
id: P:Autodesk.Revit.DB.Group.AttachedParentId
source: html/52a0655a-26fc-7f2b-17b1-5d48c75dea70.htm
---
# Autodesk.Revit.DB.Group.AttachedParentId Property

Indicates the Id of the parent group this group is attached to.

## Syntax (C#)
```csharp
public ElementId AttachedParentId { get; }
```